MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-NUMBER = ZEROES.
    DISPLAY "Invalid customer number."
    STOP RUN.
END-IF.

READ CUSTOMER-FILE AT END DISPLAY "Customer not found." STOP RUN.

IF WS-CUSTOMER-NAME = SPACES
    DISPLAY "Customer name not found for customer number " WS-CUSTOMER-NUMBER
    STOP RUN
END-IF

MOVE WS-CUSTOMER-NAME TO OUTPUT-CUSTOMER-NAME.