MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-NUMBER = ZEROES
    DISPLAY "Invalid customer number."
    STOP RUN
END-IF

READ CUSTOMER-FILE AT END MOVE 1 TO WS-CUSTOMER-NOT-FOUND

IF WS-CUSTOMER-NOT-FOUND = 1
    DISPLAY "Customer not found." 
ELSE
    IF WS-CUSTOMER-NAME = SPACES
        DISPLAY "Customer name not found for customer number " WS-CUSTOMER-NUMBER
    ELSE
        MOVE WS-CUSTOMER-NAME TO OUTPUT-CUSTOMER-NAME
    END-IF
END-IF.